Repository: achiavelli2024/TransducerAppMaui
Catalog: TransducerAppMaui/TransducerAppMaui/Resources/Strings/AppResources.*.resx
Languages: pt_br

# Settings_Title
source: Settings
pt_br: Configurações

# Settings_Logging_Title
source: Logging (SQLite)
pt_br: Logs (SQLite)

# Settings_EnableLogging
source: Enable logging (save logs to DB)
pt_br: Ativar logs (salvar no banco)

# Settings_LogStatus_On
source: Status: ON (saving logs to DB)
pt_br: Status: LIGADO (salvando logs no banco)

# Settings_LogStatus_Off
source: Status: OFF (no logs saved)
pt_br: Status: DESLIGADO (não salva logs)

# Settings_TipLogging
source: Tip: Keep this OFF for best performance. Turn ON only when you need to record RX/TX logs and export them.
pt_br: Dica: mantenha DESLIGADO para melhor desempenho. Ligue apenas quando precisar gravar RX/TX e exportar.

# Settings_Language_Title
source: Language
pt_br: Idioma

# Settings_AppLanguage
source: App language
pt_br: Idioma do aplicativo

# Settings_Language_Auto
source: Auto (system)
pt_br: Automático (sistema)

# Settings_Language_Current_Auto
source: Current: Auto (system)
pt_br: Atual: Automático (sistema)

# Settings_Language_Current_English
source: Current: English
pt_br: Atual: English

# Settings_Language_Current_Portuguese
source: Current: Português (Brasil)
pt_br: Atual: Português (Brasil)

# Settings_Language_Note
source: Note: Changing language will refresh the app UI.
pt_br: Nota: ao mudar o idioma, a interface do app será atualizada.

# Dialog_Error
source: Error
pt_br: Erro

# Dialog_LanguageApplied
source: Language applied. The app UI will refresh now.
pt_br: Idioma aplicado. A interface do app será atualizada agora.

# Dialog_LanguageFailed
source: Failed to apply language: {0}
pt_br: Falha ao aplicar idioma: {0}

# Nav_Home
source: Home
pt_br: Início

# Nav_Settings
source: Settings
pt_br: Configurações

# Home_Welcome_Title
source: Welcome!
pt_br: Bem-vindo!

# Home_Subtitle
source: Application for communication with the Phoenix Transducer via network interface
pt_br: Aplicativo conecta ao Transdutor Phoenix

# Home_Button_FreeTest
source: Free Test
pt_br: Teste Livre

# Home_Button_Settings
source: Settings
pt_br: Configurações

# Home_Hint_FreeTest
source: Open Free Test page
pt_br: Abrir tela de Teste Livre

# Home_Hint_Logs
source: Open Logs page
pt_br: Abrir tela de Logs

# Home_Hint_Settings
source: Open Settings page
pt_br: Abrir Configurações

# Logs_Button_Load
source: LOAD
pt_br: CARREGAR

# Logs_Button_LoadMore
source: LOAD +
pt_br: + MAIS

# Logs_Button_ClearUi
source: CLEAR UI
pt_br: LIMPAR TELA

# Logs_Button_ExportCsv
source: EXPORT CSV
pt_br: EXPORTAR CSV

# Logs_Button_ClearDb
source: CLEAR DB
pt_br: LIMPAR DB

# Logs_Info_Ready
source: Ready (press LOAD)
pt_br: Pronto (clique em CARREGAR)

# Logs_Info_Loading
source: Loading...
pt_br: Carregando...

# Logs_Info_UiCleared
source: UI cleared (DB unchanged)
pt_br: Tela limpa (DB não alterado)

# Logs_Info_DbCleared
source: DB cleared
pt_br: DB limpo

# Logs_Info_Error
source: Error
pt_br: Erro

# Logs_Info_LoadedFormat
source: Loaded +{0} | Showing {1} | Total {2}
pt_br: +{0} | Exibindo {1} | Total {2}

# Logs_Confirm_Title
source: Confirm
pt_br: Confirmar

# Logs_Confirm_ClearDb
source: Delete all logs from the database?
pt_br: Apagar todos os logs do banco?

# Common_Yes
source: YES
pt_br: SIM

# Common_No
source: NO
pt_br: NÃO

# Logs_Error_Load
source: Failed to load logs: {0}
pt_br: Falha ao carregar logs: {0}

# Logs_Error_Clear
source: Failed to clear logs: {0}
pt_br: Falha ao limpar logs: {0}

# Logs_Error_Export
source: Failed to export logs: {0}
pt_br: Falha ao exportar logs: {0}

# Common_Copy
source: Copy
pt_br: Copiar

# Logs_Item_ViewFull
source: View full
pt_br: Ver completo

# Logs_Item_FullTitle
source: Full log
pt_br: Log completo

# Logs_Share_Title
source: Export Logs (CSV)
pt_br: Exportar Logs (CSV)

# FreeTest_Title
source: Transducer
pt_br: Transdutor

# FreeTest_Section_Connection
source: Connection
pt_br: Conexão

# FreeTest_Button_Connect
source: Connect
pt_br: Conectar

# FreeTest_Button_Disconnect
source: Disconnect
pt_br: Desconectar

# FreeTest_Status_Disconnected
source: Status: Disconnected
pt_br: Desconectado

# FreeTest_Label_ShowTrace
source: Show trace
pt_br: Mostrar trace

# FreeTest_Label_ShowStats
source: Show stats
pt_br: Mostrar stats

# FreeTest_Label_Reconnection
source: Reconnection: {0}
pt_br: Reconexões: {0}

# FreeTest_Label_Uptime
source: Uptime: {0}
pt_br: Tempo ativo: {0}

# FreeTest_Section_LiveValues
source: Live values
pt_br: Valores ao vivo

# FreeTest_Label_Angle
source: Angle
pt_br: Ângulo

# FreeTest_Label_Results
source: Results
pt_br: Resultados

# FreeTest_Section_Parameters
source: Parameters
pt_br: Parâmetros

# FreeTest_Label_Frequency
source: Frequency:
pt_br: Frequência:

# FreeTest_Label_Min
source: Min:
pt_br: Mín:

# FreeTest_Label_Max
source: Max:
pt_br: Máx:

# FreeTest_Label_Tool
source: Tool:
pt_br: Ferramenta:

# FreeTest_Picker_ToolType_Title
source: Select tool type
pt_br: Selecione a ferramenta

# FreeTest_Status_Idle
source: Status: Idle
pt_br: Status: Parado

# FreeTest_Stats_Mean
source: Mean: n/a
pt_br: Média: n/a

# FreeTest_Section_ResultsHistory
source: Results history
pt_br: Histórico de resultados

# FreeTest_Button_ExportResults
source: EXPORT RESULTS
pt_br: EXPORTAR RESULTADOS

# FreeTest_Button_ClearResults
source: Clean Results
pt_br: Limpar resultados

# FreeTest_Button_InitRead
source: Init Read
pt_br: Iniciar leitura

# FreeTest_Button_Stop
source: Stop
pt_br: Parar

# FreeTest_Button_Zero
source: Zero Tq An
pt_br: Zerar Tq/An

# FreeTest_Button_ClearLog
source: Clear Log
pt_br: Limpar log

# FreeTest_Button_CopyLog
source: Copy Log
pt_br: Copiar log

# FreeTest_Label_ShowLogs
source: Show Logs
pt_br: Mostrar logs

# FreeTest_Label_PauseLogs
source: Pause Logs
pt_br: Pausar logs

# FreeTest_Button_ExportLogs
source: EXPORT LOGS
pt_br: EXPORTAR LOGS

# FreeTest_Alert_WarningTitle
source: Warning
pt_br: Aviso

# FreeTest_Alert_ErrorTitle
source: Error
pt_br: Erro

# FreeTest_Warn_ConnectBefore
source: Connect to the transducer first.
pt_br: Conecte ao transdutor antes.

# FreeTest_Confirm_Params_Title
source: Confirm parameters
pt_br: Confirmar parâmetros

# FreeTest_Confirm_Params_Proceed
source: Proceed
pt_br: Prosseguir

# FreeTest_Confirm_Params_Cancel
source: Cancel
pt_br: Cancelar

# FreeTest_Error_InitRead
source: InitRead failed: {0}
pt_br: Falha no InitRead: {0}

# FreeTest_Error_Stop
source: Failed to stop: {0}
pt_br: Falha ao parar: {0}

# FreeTest_Error_Connect
source: Failed to connect: {0}
pt_br: Falha ao conectar: {0}

# FreeTest_Error_Disconnect
source: Failed to disconnect: {0}
pt_br: Falha ao desconectar: {0}

# FreeTest_Conn_Connecting
source: Connecting
pt_br: Conectando

# FreeTest_Conn_Connected
source: Connected
pt_br: Conectado

# FreeTest_Conn_Disconnected
source: Disconnected
pt_br: Desconectado

# FreeTest_Status_Connecting
source: Status: Connecting
pt_br: Status: Conectando

# FreeTest_Status_Connected
source: Status: Connected
pt_br: Status: Conectado

# FreeTest_Status_StartingAcq
source: Status: Starting acquisition...
pt_br: Status: Iniciando aquisição...

# FreeTest_Status_AcqStarted
source: Status: Acquisition started
pt_br: Status: Aquisição iniciada

# FreeTest_Status_Stopped
source: Status: Stopped
pt_br: Status: Parado

# FreeTest_Status_ErrorCode
source: Status: Error ER{0:00}
pt_br: Status: Erro ER{0:00}

# FreeTest_Status_ErrorGeneric
source: Status: Error
pt_br: Status: Erro
